Changweibin/TEST/Drivers/FM33LD5xx_FL_Driver/Inc/fm33ld5xx_fl_spi.h
#define    SPI_ISR_TXBE_Pos                                       (1U)
#define    SPI_ISR_TXBE_Msk                                       (0x1U << SPI_ISR_TXBE_Pos)
#define    SPI_ISR_TXBE                                           SPI_ISR_TXBE_Msk

#define    SPI_ISR_RXBF_Pos                                       (0U)
#define    SPI_ISR_RXBF_Msk                                       (0x1U << SPI_ISR_RXBF_Pos)
#define    SPI_ISR_RXBF                                            SPI_ISR_RXBF_Msk

#define    SPI_I2SCR_I2SRXOPT_Pos                                 (12U)
#define    SPI_I2SCR_I2SRXOPT_Msk                                 (0x1U << SPI_I2SCR_I2SRXOPT_Pos)
#define    SPI_I2SCR_I2SRXOPT                                      SPI_I2SCR_I2SRXOPT_Msk

#define    SPI_I2SCR_I2SSTD_Pos                                   (10U)
#define    SPI_I2SCR_I2SSTD_Msk                                   (0x3U << SPI_I2SCR_I2SSTD_Pos)
#define    SPI_I2SCR_I2SSTD                                       SPI_I2SCR_I2SSTD_Msk

#define    SPI_I2SCR_CHLEN_Pos                                    (9U)
#define    SPI_I2SCR_CHLEN_Msk                                    (0x1U << SPI_I2SCR_CHLEN_Pos)
#define    SPI_I2SCR_CHLEN                                        SPI_I2SCR_CHLEN_Msk

#define    SPI_I2SCR_CKPOL_Pos                                    (8U)
#define    SPI_I2SCR_CKPOL_Msk                                    (0x1U << SPI_I2SCR_CKPOL_Pos)
#define    SPI_I2SCR_CKPOL                                        SPI_I2SCR_CKPOL_Msk

#define    SPI_I2SCR_DLEN_Pos                                     (6U)
#define    SPI_I2SCR_DLEN_Msk                                     (0x3U << SPI_I2SCR_DLEN_Pos)
#define    SPI_I2SCR_DLEN                                         SPI_I2SCR_DLEN_Msk

#define    SPI_I2SCR_PCMSYNC_Pos                                  (5U)
#define    SPI_I2SCR_PCMSYNC_Msk                                  (0x1U << SPI_I2SCR_PCMSYNC_Pos)
#define    SPI_I2SCR_PCMSYNC                                      SPI_I2SCR_PCMSYNC_Msk

#define    SPI_I2SCR_I2SMM_Pos                                    (3U)
#define    SPI_I2SCR_I2SMM_Msk                                    (0x3U << SPI_I2SCR_I2SMM_Pos)
#define    SPI_I2SCR_I2SMM                                        SPI_I2SCR_I2SMM_Msk

#define    SPI_I2SCR_DLYEN_Pos                                    (2U)
#define    SPI_I2SCR_DLYEN_Msk                                    (0x1U << SPI_I2SCR_DLYEN_Pos)
#define    SPI_I2SCR_DLYEN                                        SPI_I2SCR_DLYEN_Msk

#define    SPI_I2SCR_I2SMOD_Pos                                   (1U)
#define    SPI_I2SCR_I2SMOD_Msk                                   (0x1U << SPI_I2SCR_I2SMOD_Pos)
#define    SPI_I2SCR_I2SMOD                                       SPI_I2SCR_I2SMOD_Msk

#define    SPI_I2SCR_I2SEN_Pos                                    (0U)
#define    SPI_I2SCR_I2SEN_Msk                                    (0x1U << SPI_I2SCR_I2SEN_Pos)
#define    SPI_I2SCR_I2SEN                                        SPI_I2SCR_I2SEN_Msk

#define    SPI_I2SPR_MCKOE_Pos                                    (9U)
#define    SPI_I2SPR_MCKOE_Msk                                    (0x1U << SPI_I2SPR_MCKOE_Pos)
#define    SPI_I2SPR_MCKOE                                        SPI_I2SPR_MCKOE_Msk

#define    SPI_I2SPR_ODD_Pos                                      (8U)
#define    SPI_I2SPR_ODD_Msk                                      (0x1U << SPI_I2SPR_ODD_Pos)
#define    SPI_I2SPR_ODD                                          SPI_I2SPR_ODD_Msk

#define    SPI_I2SPR_CLKDIV_Pos                                   (0U)
#define    SPI_I2SPR_CLKDIV_Msk                                   (0xffU << SPI_I2SPR_CLKDIV_Pos)
#define    SPI_I2SPR_CLKDIV                                       SPI_I2SPR_CLKDIV_Msk

#define    FL_SPI_MASTER_SAMPLING_NORMAL                          (0x0U << SPI_CR1_MSPA_Pos)
#define    FL_SPI_MASTER_SAMPLING_DELAY_HALFCLK                   (0x1U << SPI_CR1_MSPA_Pos)

#define    FL_SPI_SLAVE_SAMPLING_NORMAL                           (0x0U << SPI_CR1_SSPA_Pos)
#define    FL_SPI_SLAVE_SAMPLING_ADVANCE_HALFCLK                  (0x1U << SPI_CR1_SSPA_Pos)

#define    FL_SPI_WORK_MODE_SLAVE                                 (0x0U << SPI_CR1_MM_Pos)
#define    FL_SPI_WORK_MODE_MASTER                                (0x1U << SPI_CR1_MM_Pos)

#define    FL_SPI_SEND_WAIT_0                                     (0x0U << SPI_CR1_WAIT_Pos)
#define    FL_SPI_SEND_WAIT_1                                     (0x1U << SPI_CR1_WAIT_Pos)
#define    FL_SPI_SEND_WAIT_2                                     (0x2U << SPI_CR1_WAIT_Pos)
#define    FL_SPI_SEND_WAIT_3                                     (0x3U << SPI_CR1_WAIT_Pos)

#define    FL_SPI_PCLK_DIV2                                       (0x0U << SPI_CR1_BAUD_Pos)
#define    FL_SPI_PCLK_DIV4                                       (0x1U << SPI_CR1_BAUD_Pos)
#define    FL_SPI_PCLK_DIV8                                       (0x2U << SPI_CR1_BAUD_Pos)
#define    FL_SPI_PCLK_DIV16                                      (0x3U << SPI_CR1_BAUD_Pos)
#define    FL_SPI_PCLK_DIV32                                      (0x4U << SPI_CR1_BAUD_Pos)
#define    FL_SPI_PCLK_DIV64                                      (0x5U << SPI_CR1_BAUD_Pos)
#define    FL_SPI_PCLK_DIV128                                     (0x6U << SPI_CR1_BAUD_Pos)
#define    FL_SPI_PCLK_DIV256                                     (0x7U << SPI_CR1_BAUD_Pos)

#define    FL_SPI_BIT_ORDER_MSB_FIRST                             (0x0U << SPI_CR1_LSBF_Pos)
#define    FL_SPI_BIT_ORDER_LSB_FIRST                             (0x1U << SPI_CR1_LSBF_Pos)

#define    FL_SPI_POLARITY_NORMAL                                 (0x0U << SPI_CR1_CPOL_Pos)
#define    FL_SPI_POLARITY_INVERT                                 (0x1U << SPI_CR1_CPOL_Pos)

#define    FL_SPI_PHASE_EDGE1                                     (0x0U << SPI_CR1_CPHA_Pos)
#define    FL_SPI_PHASE_EDGE2                                     (0x1U << SPI_CR1_CPHA_Pos)

#define    FL_SPI_DATAH_LENGTH0                                   (0x0U << SPI_CR2_DLEN2_Pos)
#define    FL_SPI_DATAH_LENGTH1                                   (0x1U << SPI_CR2_DLEN2_Pos)
#define    FL_SPI_DATAH_LENGTH2                                   (0x2U << SPI_CR2_DLEN2_Pos)
#define    FL_SPI_DATAH_LENGTH3                                   (0x3U << SPI_CR2_DLEN2_Pos)
#define    FL_SPI_DATAH_LENGTH4                                   (0x4U << SPI_CR2_DLEN2_Pos)
#define    FL_SPI_DATAH_LENGTH5                                   (0x5U << SPI_CR2_DLEN2_Pos)
#define    FL_SPI_DATAH_LENGTH6                                   (0x6U << SPI_CR2_DLEN2_Pos)
#define    FL_SPI_DATAH_LENGTH7                                   (0x7U << SPI_CR2_DLEN2_Pos)

#define    FL_SPI_DATAL_LENGTH0                                   (0x0U << SPI_CR2_DLEN_Pos)
#define    FL_SPI_DATAL_LENGTH1                                   (0x1U << SPI_CR2_DLEN_Pos)
#define    FL_SPI_DATAL_LENGTH2                                   (0x2U << SPI_CR2_DLEN_Pos)
#define    FL_SPI_DATAL_LENGTH3                                   (0x3U << SPI_CR2_DLEN_Pos)

#define    FL_SPI_TRANSFER_MODE_FULL_DUPLEX                       (0x0U << SPI_CR2_HALFDUPLEX_Pos)
#define    FL_SPI_TRANSFER_MODE_HALF_DUPLEX                       (0x1U << SPI_CR2_HALFDUPLEX_Pos)

#define    FL_SPI_HALF_DUPLEX_TX                                  (0x0U << SPI_CR2_HD_RW_Pos)
#define    FL_SPI_HALF_DUPLEX_RX                                  (0x1U << SPI_CR2_HD_RW_Pos)

