Changweibin/TEST/Drivers/FM33LD5xx_FL_Driver/Inc/fm33ld5xx_fl_spi.h
#define    FL_SPI_HALF_DUPLEX_CMDLEN_DLEN                         (0x0U << SPI_CR2_CMD8B_Pos)
#define    FL_SPI_HALF_DUPLEX_CMDLEN_8B                           (0x1U << SPI_CR2_CMD8B_Pos)

#define    FL_SPI_HALFDUPLEX_CMDLEN_DLEN                          (0x0U << SPI_CR2_CMD8B_Pos)
#define    FL_SPI_HALFDUPLEX_CMDLEN_8B                            (0x1U << SPI_CR2_CMD8B_Pos)

#define    FL_SPI_HARDWARE_SSN_KEEP_LOW                           (0x0U << SPI_CR2_SSNM_Pos)
#define    FL_SPI_HARDWARE_SSN_AUTO_HIGH                          (0x1U << SPI_CR2_SSNM_Pos)

#define    FL_SPI_SSN_LOW                                         (0x0U << SPI_CR2_SSN_Pos)
#define    FL_SPI_SSN_HIGH                                        (0x1U << SPI_CR2_SSN_Pos)

#define    FL_SPI_FRAME_MODE_CMD                                  (0x0U << SPI_ISR_DCN_TX_Pos)
#define    FL_SPI_FRAME_MODE_DATA                                 (0x1U << SPI_ISR_DCN_TX_Pos)

#define    FL_I2S_VOCAL_TRACT_LEFT                                (0x0U << SPI_ISR_CHSIDE_Pos)
#define    FL_I2S_VOCAL_TRACT_RIGHT                               (0x1U << SPI_ISR_CHSIDE_Pos)
	
#define    FL_I2S_MASTER_CLKOUTPUT_CONTINUOUS                     (0x0U << SPI_I2SCR_I2SRXOPT_Pos)
#define    FL_I2S_MASTER_CLKOUTPUT_NOCONTINUOUS                   (0x1U << SPI_I2SCR_I2SRXOPT_Pos)

#define    FL_I2S_STANDARD_MODE_PHILIPS                           (0x0U << SPI_I2SCR_I2SSTD_Pos)
#define    FL_I2S_STANDARD_MODE_MSB_JUSTIFIED                     (0x1U << SPI_I2SCR_I2SSTD_Pos)
#define    FL_I2S_STANDARD_MODE_LSB_JUSTIFIED                     (0x2U << SPI_I2SCR_I2SSTD_Pos)
#define    FL_I2S_STANDARD_MODE_PCM                               (0x3U << SPI_I2SCR_I2SSTD_Pos)

#define    FL_I2S_VOCAL_TRACT_LENGTH_16BITS                       (0x0U << SPI_I2SCR_CHLEN_Pos)
#define    FL_I2S_VOCAL_TRACT_LENGTH_32BITS                       (0x1U << SPI_I2SCR_CHLEN_Pos)

#define    FL_I2S_IDLE_POLARITY_LOW                               (0x0U << SPI_I2SCR_CKPOL_Pos)
#define    FL_I2S_IDLE_POLARITY_HIGHT                             (0x1U << SPI_I2SCR_CKPOL_Pos)

#define    FL_I2S_DATA_LENGTH_16BITS                              (0x0U << SPI_I2SCR_DLEN_Pos)
#define    FL_I2S_DATA_LENGTH_24BITS                              (0x1U << SPI_I2SCR_DLEN_Pos)
#define    FL_I2S_DATA_LENGTH_32BITS                              (0x2U << SPI_I2SCR_DLEN_Pos)

#define    FL_I2S_FRAME_SYNCHRONIZATION_SHORT                     (0x0U << SPI_I2SCR_PCMSYNC_Pos)
#define    FL_I2S_FRAME_SYNCHRONIZATION_LONG                      (0x1U << SPI_I2SCR_PCMSYNC_Pos)

#define    FL_I2S_MODE_SLAVE_RX                                   (0x0U << SPI_I2SCR_I2SMM_Pos)
#define    FL_I2S_MODE_SLAVE_TX                                   (0x1U << SPI_I2SCR_I2SMM_Pos)
#define    FL_I2S_MODE_MASTER_RX                                  (0x2U << SPI_I2SCR_I2SMM_Pos)
#define    FL_I2S_MODE_MASTER_TX                                  (0x3U << SPI_I2SCR_I2SMM_Pos)

#define    FL_I2S_PERIPHRAL_MODE_SPI                              (0x0U << SPI_I2SCR_I2SMOD_Pos)
#define    FL_I2S_PERIPHRAL_MODE_I2S                              (0x1U << SPI_I2SCR_I2SMOD_Pos)

#define    FL_I2S_PRESCALER_PARITY_EVEN                           (0x0U << SPI_I2SPR_ODD_Pos)
#define    FL_I2S_PRESCALER_PARITY_ODD                            (0x1U << SPI_I2SPR_ODD_Pos)

/**
  * @}
  */
/* Exported functions ---------------------------------------------------------------------------------*/
/** @defgroup SPI_FL_Exported_Functions SPI Exported Functions
  * @{
  */

/**
  * @brief    Enable SPI IO Pin Swap
  * @rmtoll   CR1    IOSWAP    FL_SPI_EnablePinSwap
  * @param    SPIx SPI instance
  * @retval   None
  */
__STATIC_INLINE void FL_SPI_EnablePinSwap(SPI_Type *SPIx)
{
    SET_BIT(SPIx->CR1, SPI_CR1_IOSWAP_Msk);
}

/**
  * @brief    Get SPI IO Pin Swap State
  * @rmtoll   CR1    IOSWAP    FL_SPI_IsEnabledPinSwap
  * @param    SPIx SPI instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_SPI_IsEnabledPinSwap(SPI_Type *SPIx)
{
    return (uint32_t)(READ_BIT(SPIx->CR1, SPI_CR1_IOSWAP_Msk) == SPI_CR1_IOSWAP_Msk);
}

/**
  * @brief    Disable SPI IO Pin Swap
  * @rmtoll   CR1    IOSWAP    FL_SPI_DisablePinSwap
  * @param    SPIx SPI instance
  * @retval   None
  */
__STATIC_INLINE void FL_SPI_DisablePinSwap(SPI_Type *SPIx)
{
    CLEAR_BIT(SPIx->CR1, SPI_CR1_IOSWAP_Msk);
}

/**
  * @brief    Set Master Sampling Position Adjustment
  * @rmtoll   CR1    MSPA    FL_SPI_SetMasterSamplingAdjust
  * @param    SPIx SPI instance
  * @param    adjust This parameter can be one of the following values:
  *           @arg @ref FL_SPI_MASTER_SAMPLING_NORMAL
  *           @arg @ref FL_SPI_MASTER_SAMPLING_DELAY_HALFCLK
  * @retval   None
  */
__STATIC_INLINE void FL_SPI_SetMasterSamplingAdjust(SPI_Type *SPIx, uint32_t adjust)
{
    MODIFY_REG(SPIx->CR1, SPI_CR1_MSPA_Msk, adjust);
}

/**
  * @brief    Get Master Sampling Position Adjustment
  * @rmtoll   CR1    MSPA    FL_SPI_GetMasterSamplingAdjust
  * @param    SPIx SPI instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_SPI_MASTER_SAMPLING_NORMAL
  *           @arg @ref FL_SPI_MASTER_SAMPLING_DELAY_HALFCLK
  */
__STATIC_INLINE uint32_t FL_SPI_GetMasterSamplingAdjust(SPI_Type *SPIx)
{
    return (uint32_t)(READ_BIT(SPIx->CR1, SPI_CR1_MSPA_Msk));
}

/**
  * @brief    Set Slave Sending Position Adjustment
  * @rmtoll   CR1    SSPA    FL_SPI_SetSlaveSamplingAdjust
  * @param    SPIx SPI instance
  * @param    adjust This parameter can be one of the following values:
  *           @arg @ref FL_SPI_SLAVE_SAMPLING_NORMAL
  *           @arg @ref FL_SPI_SLAVE_SAMPLING_ADVANCE_HALFCLK
  * @retval   None
  */
__STATIC_INLINE void FL_SPI_SetSlaveSamplingAdjust(SPI_Type *SPIx, uint32_t adjust)
{
    MODIFY_REG(SPIx->CR1, SPI_CR1_SSPA_Msk, adjust);
}

/**
  * @brief    Get Slave Sending Position Adjustment
  * @rmtoll   CR1    SSPA    FL_SPI_GetSlaveSamplingAdjust
  * @param    SPIx SPI instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_SPI_SLAVE_SAMPLING_NORMAL
  *           @arg @ref FL_SPI_SLAVE_SAMPLING_ADVANCE_HALFCLK
  */
__STATIC_INLINE uint32_t FL_SPI_GetSlaveSamplingAdjust(SPI_Type *SPIx)
{
    return (uint32_t)(READ_BIT(SPIx->CR1, SPI_CR1_SSPA_Msk));
}

/**
  * @brief    Set SPI Working Mode
  * @rmtoll   CR1    MM    FL_SPI_SetWorkMode
  * @param    SPIx SPI instance
  * @param    mode This parameter can be one of the following values:
  *           @arg @ref FL_SPI_WORK_MODE_SLAVE
  *           @arg @ref FL_SPI_WORK_MODE_MASTER
  * @retval   None
  */
__STATIC_INLINE void FL_SPI_SetWorkMode(SPI_Type *SPIx, uint32_t mode)
{
    MODIFY_REG(SPIx->CR1, SPI_CR1_MM_Msk, mode);
}

/**
  * @brief    Get SPI Working Mode
  * @rmtoll   CR1    MM    FL_SPI_GetWorkMode
  * @param    SPIx SPI instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_SPI_WORK_MODE_SLAVE
  *           @arg @ref FL_SPI_WORK_MODE_MASTER
  */
__STATIC_INLINE uint32_t FL_SPI_GetWorkMode(SPI_Type *SPIx)
{
    return (uint32_t)(READ_BIT(SPIx->CR1, SPI_CR1_MM_Msk));
}

/**
  * @brief    Set SPI Send Wait Cycle Length in Master Mode
  * @rmtoll   CR1    WAIT    FL_SPI_SetSendWait
  * @param    SPIx SPI instance
  * @param    wait This parameter can be one of the following values:
  *           @arg @ref FL_SPI_SEND_WAIT_0
  *           @arg @ref FL_SPI_SEND_WAIT_1
  *           @arg @ref FL_SPI_SEND_WAIT_2
  *           @arg @ref FL_SPI_SEND_WAIT_3
  * @retval   None
  */
__STATIC_INLINE void FL_SPI_SetSendWait(SPI_Type *SPIx, uint32_t wait)
{
    MODIFY_REG(SPIx->CR1, SPI_CR1_WAIT_Msk, wait);
}

/**
  * @brief    Get SPI Send Wait Cycle Length in Master Mode
  * @rmtoll   CR1    WAIT    FL_SPI_GetSendWait
  * @param    SPIx SPI instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_SPI_SEND_WAIT_0
  *           @arg @ref FL_SPI_SEND_WAIT_1
  *           @arg @ref FL_SPI_SEND_WAIT_2
  *           @arg @ref FL_SPI_SEND_WAIT_3
  */
__STATIC_INLINE uint32_t FL_SPI_GetSendWait(SPI_Type *SPIx)
{
    return (uint32_t)(READ_BIT(SPIx->CR1, SPI_CR1_WAIT_Msk));
}

/**
  * @brief    Set SPI Baudrate in Master Mode
  * @rmtoll   CR1    BAUD    FL_SPI_SetBaudRate
  * @param    SPIx SPI instance
  * @param    clock This parameter can be one of the following values:
  *           @arg @ref FL_SPI_PCLK_DIV2
  *           @arg @ref FL_SPI_PCLK_DIV4
  *           @arg @ref FL_SPI_PCLK_DIV8
  *           @arg @ref FL_SPI_PCLK_DIV16
  *           @arg @ref FL_SPI_PCLK_DIV32
  *           @arg @ref FL_SPI_PCLK_DIV64
  *           @arg @ref FL_SPI_PCLK_DIV128
  *           @arg @ref FL_SPI_PCLK_DIV256
  * @retval   None
  */
__STATIC_INLINE void FL_SPI_SetBaudRate(SPI_Type *SPIx, uint32_t clock)
{
    MODIFY_REG(SPIx->CR1, SPI_CR1_BAUD_Msk, clock);
}

/**
  * @brief    Get SPI Baudrate in Master Mode
  * @rmtoll   CR1    BAUD    FL_SPI_GetBaudRate
  * @param    SPIx SPI instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_SPI_PCLK_DIV2
  *           @arg @ref FL_SPI_PCLK_DIV4
  *           @arg @ref FL_SPI_PCLK_DIV8
  *           @arg @ref FL_SPI_PCLK_DIV16
  *           @arg @ref FL_SPI_PCLK_DIV32
  *           @arg @ref FL_SPI_PCLK_DIV64
  *           @arg @ref FL_SPI_PCLK_DIV128
  *           @arg @ref FL_SPI_PCLK_DIV256
  */
__STATIC_INLINE uint32_t FL_SPI_GetBaudRate(SPI_Type *SPIx)
{
    return (uint32_t)(READ_BIT(SPIx->CR1, SPI_CR1_BAUD_Msk));
}

/**
  * @brief    Set SPI Bit Order
  * @rmtoll   CR1    LSBF    FL_SPI_SetBitOrder
  * @param    SPIx SPI instance
  * @param    bitOrder This parameter can be one of the following values:
  *           @arg @ref FL_SPI_BIT_ORDER_MSB_FIRST
  *           @arg @ref FL_SPI_BIT_ORDER_LSB_FIRST
  * @retval   None
  */
__STATIC_INLINE void FL_SPI_SetBitOrder(SPI_Type *SPIx, uint32_t bitOrder)
{
    MODIFY_REG(SPIx->CR1, SPI_CR1_LSBF_Msk, bitOrder);
}

/**
  * @brief    Get SPI Bit Order
  * @rmtoll   CR1    LSBF    FL_SPI_GetBitOrder
  * @param    SPIx SPI instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_SPI_BIT_ORDER_MSB_FIRST
  *           @arg @ref FL_SPI_BIT_ORDER_LSB_FIRST
  */
__STATIC_INLINE uint32_t FL_SPI_GetBitOrder(SPI_Type *SPIx)
{
    return (uint32_t)(READ_BIT(SPIx->CR1, SPI_CR1_LSBF_Msk));
}

/**
  * @brief    Set SPI Clock Polarity
  * @rmtoll   CR1    CPOL    FL_SPI_SetClockPolarity
  * @param    SPIx SPI instance
  * @param    polarity This parameter can be one of the following values:
  *           @arg @ref FL_SPI_POLARITY_NORMAL
  *           @arg @ref FL_SPI_POLARITY_INVERT
  * @retval   None
  */
__STATIC_INLINE void FL_SPI_SetClockPolarity(SPI_Type *SPIx, uint32_t polarity)
{
    MODIFY_REG(SPIx->CR1, SPI_CR1_CPOL_Msk, polarity);
}

/**
  * @brief    Get SPI Clock Polarity
  * @rmtoll   CR1    CPOL    FL_SPI_GetClockPolarity
  * @param    SPIx SPI instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_SPI_POLARITY_NORMAL
  *           @arg @ref FL_SPI_POLARITY_INVERT
  */
__STATIC_INLINE uint32_t FL_SPI_GetClockPolarity(SPI_Type *SPIx)
{
    return (uint32_t)(READ_BIT(SPIx->CR1, SPI_CR1_CPOL_Msk));
}

/**
  * @brief    Set SPI Clock Phase
  * @rmtoll   CR1    CPHA    FL_SPI_SetClockPhase
  * @param    SPIx SPI instance
  * @param    phase This parameter can be one of the following values:
  *           @arg @ref FL_SPI_PHASE_EDGE1
  *           @arg @ref FL_SPI_PHASE_EDGE2
  * @retval   None
  */
__STATIC_INLINE void FL_SPI_SetClockPhase(SPI_Type *SPIx, uint32_t phase)
{
    MODIFY_REG(SPIx->CR1, SPI_CR1_CPHA_Msk, phase);
}

/**
  * @brief    Get SPI Clock Phase
  * @rmtoll   CR1    CPHA    FL_SPI_GetClockPhase
  * @param    SPIx SPI instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_SPI_PHASE_EDGE1
  *           @arg @ref FL_SPI_PHASE_EDGE2
  */
__STATIC_INLINE uint32_t FL_SPI_GetClockPhase(SPI_Type *SPIx)
{
    return (uint32_t)(READ_BIT(SPIx->CR1, SPI_CR1_CPHA_Msk));
}

/**
  * @brief    Enable SPI Dummy Cycle Setting Under 4-lines Half Duplex Mode
  * @rmtoll   CR2    DUMMY_EN    FL_SPI_EnableDummyCycle
  * @param    SPIx SPI instance
  * @retval   None
  */
__STATIC_INLINE void FL_SPI_EnableDummyCycle(SPI_Type *SPIx)
{
    SET_BIT(SPIx->CR2, SPI_CR2_DUMMY_EN_Msk);
}

/**
  * @brief    Disable SPI Dummy Cycle Setting Under 4-lines Half Duplex Mode
  * @rmtoll   CR2    DUMMY_EN    FL_SPI_DisableDummyCycle
  * @param    SPIx SPI instance
  * @retval   None
  */
__STATIC_INLINE void FL_SPI_DisableDummyCycle(SPI_Type *SPIx)
{
    CLEAR_BIT(SPIx->CR2, SPI_CR2_DUMMY_EN_Msk);
}

/**
  * @brief    Get SPI Dummy Cycle Mode Setting
  * @rmtoll   CR2    DUMMY_EN    FL_SPI_IsEnabledDummyCycle
  * @param    SPIx SPI instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_SPI_IsEnabledDummyCycle(SPI_Type *SPIx)
{
    return (uint32_t)(READ_BIT(SPIx->CR2, SPI_CR2_DUMMY_EN_Msk) == SPI_CR2_DUMMY_EN_Msk);
}

/**
  * @brief    Set SPI Data LENGTH 2-4bit
  * @rmtoll   CR2    DLEN2    FL_SPI_SetLengthDataL
  * @param    SPIx SPI instance
  * @param    length This parameter can be one of the following values:
  *           @arg @ref FL_SPI_DATAL_LENGTH0
  *           @arg @ref FL_SPI_DATAL_LENGTH1
  *           @arg @ref FL_SPI_DATAL_LENGTH2
  *           @arg @ref FL_SPI_DATAL_LENGTH3
  *           @arg @ref FL_SPI_DATAL_LENGTH4
  *           @arg @ref FL_SPI_DATAL_LENGTH5
  *           @arg @ref FL_SPI_DATAL_LENGTH6
  *           @arg @ref FL_SPI_DATAL_LENGTH7
  * @retval   None
  */
__STATIC_INLINE void FL_SPI_SetLengthDataL(SPI_Type *SPIx, uint32_t length)
{
    MODIFY_REG(SPIx->CR2, SPI_CR2_DLEN2_Msk, length);
}

/**
  * @brief    Get SPI Data LENGTH
  * @rmtoll   CR2    DLEN2    FL_SPI_GetLengthDataL
  * @param    SPIx SPI instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_SPI_DATAL_LENGTH0
  *           @arg @ref FL_SPI_DATAL_LENGTH1
  *           @arg @ref FL_SPI_DATAL_LENGTH2
  *           @arg @ref FL_SPI_DATAL_LENGTH3
  *           @arg @ref FL_SPI_DATAL_LENGTH4
  *           @arg @ref FL_SPI_DATAL_LENGTH5
  *           @arg @ref FL_SPI_DATAL_LENGTH6
  *           @arg @ref FL_SPI_DATAL_LENGTH7
  */
__STATIC_INLINE uint32_t FL_SPI_GetLengthDataL(SPI_Type *SPIx)
{
    return (uint32_t)(READ_BIT(SPIx->CR2, SPI_CR2_DLEN2_Msk));
}

/**
  * @brief    Set SPI Data LENGTH
  * @rmtoll   CR2    DLEN    FL_SPI_SetLengthDataH
  * @param    SPIx SPI instance
  * @param    length This parameter can be one of the following values:
  *           @arg @ref FL_SPI_DATAH_LENGTH0
  *           @arg @ref FL_SPI_DATAH_LENGTH1
  *           @arg @ref FL_SPI_DATAH_LENGTH2
  *           @arg @ref FL_SPI_DATAH_LENGTH3
  * @retval   None
  */
__STATIC_INLINE void FL_SPI_SetLengthDataH(SPI_Type *SPIx, uint32_t length)
{
    MODIFY_REG(SPIx->CR2, SPI_CR2_DLEN_Msk, length);
}

/**
  * @brief    Get SPI Data LENGTH
  * @rmtoll   CR2    DLEN    FL_SPI_GetLengthDataL
  * @param    SPIx SPI instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_SPI_DATAH_LENGTH0
  *           @arg @ref FL_SPI_DATAH_LENGTH1
  *           @arg @ref FL_SPI_DATAH_LENGTH2
  *           @arg @ref FL_SPI_DATAH_LENGTH3
  */
__STATIC_INLINE uint32_t FL_SPI_GetLengthDataH(SPI_Type *SPIx)
{
    return (uint32_t)(READ_BIT(SPIx->CR2, SPI_CR2_DLEN_Msk));
}

/**
  * @brief    Set SPI Data LENGTH
  * @rmtoll   temp0    temp1    FL_SPI_GetLengthData
  * @param    SPIx SPI instance
  * @param    length This parameter can be one of the following values:
  *           @arg @ref FL_SPI_DATALENGTH_BIT1
  *           @arg @ref FL_SPI_DATALENGTH_BIT2
  *           @arg @ref FL_SPI_DATALENGTH_BIT3
  *           @arg @ref FL_SPI_DATALENGTH_BIT4
  *           @arg @ref FL_SPI_DATALENGTH_BIT5
  *           @arg @ref FL_SPI_DATALENGTH_BIT6
  *           @arg @ref FL_SPI_DATALENGTH_BIT7
  *           @arg @ref FL_SPI_DATALENGTH_BIT8
  *           @arg @ref FL_SPI_DATALENGTH_BIT9
  *           @arg @ref FL_SPI_DATALENGTH_BIT10
  *           @arg @ref FL_SPI_DATALENGTH_BIT11
  *           @arg @ref FL_SPI_DATALENGTH_BIT12
  *           @arg @ref FL_SPI_DATALENGTH_BIT13
  *           @arg @ref FL_SPI_DATALENGTH_BIT14
  *           @arg @ref FL_SPI_DATALENGTH_BIT15
  *           @arg @ref FL_SPI_DATALENGTH_BIT16
  *           @arg @ref FL_SPI_DATALENGTH_BIT17
  *           @arg @ref FL_SPI_DATALENGTH_BIT18
  *           @arg @ref FL_SPI_DATALENGTH_BIT19
  *           @arg @ref FL_SPI_DATALENGTH_BIT20
  *           @arg @ref FL_SPI_DATALENGTH_BIT21
  *           @arg @ref FL_SPI_DATALENGTH_BIT22
  *           @arg @ref FL_SPI_DATALENGTH_BIT23
  *           @arg @ref FL_SPI_DATALENGTH_BIT24
  *           @arg @ref FL_SPI_DATALENGTH_BIT25
  *           @arg @ref FL_SPI_DATALENGTH_BIT26
  *           @arg @ref FL_SPI_DATALENGTH_BIT27
  *           @arg @ref FL_SPI_DATALENGTH_BIT28
  *           @arg @ref FL_SPI_DATALENGTH_BIT29
  *           @arg @ref FL_SPI_DATALENGTH_BIT30
  *           @arg @ref FL_SPI_DATALENGTH_BIT31
  *           @arg @ref FL_SPI_DATALENGTH_BIT32
  * @retval   None
  */
__STATIC_INLINE void FL_SPI_SetDataWidth(SPI_Type *SPIx, uint32_t cr2_den, uint32_t cr2_den2)
{
    FL_SPI_SetLengthDataH(SPIx, cr2_den);
    FL_SPI_SetLengthDataL(SPIx, cr2_den2);
}
/**
  * @brief    Get SPI Data LENGTH
  * @rmtoll   temp0    temp1    FL_SPI_GetLengthData
  * @param    SPIx SPI instance
  * @param    length This parameter can be one of the following values:
  *           @arg @ref FL_SPI_DATALENGTH_BIT1
  *           @arg @ref FL_SPI_DATALENGTH_BIT2
  *           @arg @ref FL_SPI_DATALENGTH_BIT3
  *           @arg @ref FL_SPI_DATALENGTH_BIT4
  *           @arg @ref FL_SPI_DATALENGTH_BIT5
  *           @arg @ref FL_SPI_DATALENGTH_BIT6
  *           @arg @ref FL_SPI_DATALENGTH_BIT7
  *           @arg @ref FL_SPI_DATALENGTH_BIT8
  *           @arg @ref FL_SPI_DATALENGTH_BIT9
  *           @arg @ref FL_SPI_DATALENGTH_BIT10
  *           @arg @ref FL_SPI_DATALENGTH_BIT11
  *           @arg @ref FL_SPI_DATALENGTH_BIT12
  *           @arg @ref FL_SPI_DATALENGTH_BIT13
  *           @arg @ref FL_SPI_DATALENGTH_BIT14
  *           @arg @ref FL_SPI_DATALENGTH_BIT15
  *           @arg @ref FL_SPI_DATALENGTH_BIT16
  *           @arg @ref FL_SPI_DATALENGTH_BIT17
  *           @arg @ref FL_SPI_DATALENGTH_BIT18
  *           @arg @ref FL_SPI_DATALENGTH_BIT19
  *           @arg @ref FL_SPI_DATALENGTH_BIT20
  *           @arg @ref FL_SPI_DATALENGTH_BIT21
  *           @arg @ref FL_SPI_DATALENGTH_BIT22
  *           @arg @ref FL_SPI_DATALENGTH_BIT23
  *           @arg @ref FL_SPI_DATALENGTH_BIT24
  *           @arg @ref FL_SPI_DATALENGTH_BIT25
  *           @arg @ref FL_SPI_DATALENGTH_BIT26
  *           @arg @ref FL_SPI_DATALENGTH_BIT27
  *           @arg @ref FL_SPI_DATALENGTH_BIT28
  *           @arg @ref FL_SPI_DATALENGTH_BIT29
  *           @arg @ref FL_SPI_DATALENGTH_BIT30
  *           @arg @ref FL_SPI_DATALENGTH_BIT31
  *           @arg @ref FL_SPI_DATALENGTH_BIT32
  * @retval   None
  */
__STATIC_INLINE uint32_t FL_SPI_GetDataWidth(SPI_Type *SPIx)
{
    uint32_t datawith_l = 0;
    uint32_t datawith_h = 0;
    uint32_t datawith = 0;

